document.addEventListener('click', function () {
  const blogPageTitle = document.querySelector('.blogPage-title');
  const blogPageText = document.querySelector('.blogPage-text');

  const paragraphs = document.querySelectorAll('.blog-item');

  console.log();

  paragraphs.forEach(paragraph => {
    console.log(blogPageTitle.textContent);

    // text.split('').forEach((char, index) => {
    //   const span = document.createElement('span');
    //   span.textContent = char === ' ' ? '\u00A0' : char; // сохраняем пробелы
    //   span.style.animationDelay = `${index * 50}ms`; // задержка 50ms на каждый символ
    //   paragraph.appendChild(span);
    // });
  });

  //   paragraphs.forEach(paragraph => {
  //     const text = paragraph.innerText;
  //     paragraph.innerText = ''; // очищаем текст

  //     text.split('').forEach((char, index) => {
  //       const span = document.createElement('span');
  //       span.textContent = char === ' ' ? '\u00A0' : char; // сохраняем пробелы
  //       span.style.animationDelay = `${index * 50}ms`; // задержка 50ms на каждый символ
  //       paragraph.appendChild(span);
  //     });
  //   });
});

const blogs = {
  firstTitle: 'Як обрати адвоката: ключові моменти для клієнтів',
  firstText:
    "Вибір адвоката — це важливий крок для забезпечення захисту ваших прав і інтересів. Ось кілька ключових моментів, на які варто звернути увагу при виборі: Спеціалізація: Визначте, в якій галузі права вам потрібна допомога. Адвокати можуть спеціалізуватися на кримінальному, цивільному, господарському праві, а також на сімейних справах. Виберіть того, хто має досвід у вашій конкретній справі. Репутація: Досліджуйте репутацію адвоката. Ознайомтеся з відгуками інших клієнтів, дізнайтеся про його успішність у справах, і чи був він коли-небудь піддаваний дисциплінарним санкціям. Консультація: Багато адвокатів пропонують безкоштовну первинну консультацію. Використайте цю можливість, щоб оцінити, наскільки ви відчуваєте себе комфортно з адвокатом, і чи зрозумілі його пояснення. Комунікація: Важливо, щоб адвокат був доступний для вас та підтримував з вами регулярний зв'язок. Уточніть, як часто він буде звітувати про хід справи. Вартість послуг: Запитайте про структуру оплати: фіксована плата, погодинна оплата чи успішна винагорода. Переконайтеся, що ви розумієте всі витрати і що вони відповідають вашим фінансовим можливостям.",
  secondTitle:
    "Права та обов'язки працівників і роботодавців: що потрібно знати про трудові договори",
  secondText:
    "Трудовий договір — це основний документ, що регулює відносини між працівником та роботодавцем. Ось основні права і обов'язки, які варто знати: Права працівників: Право на отримання справедливої заробітної плати. Право на безпечні умови праці. Право на відпустки (основну, додаткову, лікарняні). Право на недискримінацію та повагу до особистості. Обов'язки працівників: Виконання своїх трудових обов'язків належним чином. Дотримання внутрішнього трудового розпорядку. Підтримка конфіденційності інформації компанії. Права роботодавців: Право на контроль за виконанням трудових обов'язків. Право на дисциплінарні заходи в разі порушення трудової дисципліни. Обов'язки роботодавців: Забезпечення безпечних умов праці. Виплата заробітної плати вчасно та у повному обсязі. Дотримання законодавства щодо зайнятості та трудових відносин. Для складання трудового договору важливо врахувати інтереси обох сторін, включаючи деталі щодо заробітної плати, умов праці, прав і обов'язків.",
  therdTitle:
    'Що робити у випадку сімейного спору: збереження прав у шлюбі та при розлученні',
  therdText:
    "Сімейні спори можуть бути складними і емоційно виснажливими. Ось кілька практичних порад щодо захисту ваших прав: Збереження документів: Зберігайте всі важливі документи, пов'язані з вашим шлюбом, такими як свідоцтво про шлюб, документи про майно, фінансові звіти та будь-які інші важливі документи. Юридична консультація: Зверніться до юриста, який спеціалізується на сімейному праві. Він допоможе вам зрозуміти ваші права та обов'язки, а також роз'яснить можливі наслідки ваших рішень. Розподіл майна: У разі розлучення важливо зрозуміти, як буде розподілено майно. Ознайомтеся з законами щодо поділу спільного майна і підготуйтеся до можливих переговорів. Права дітей: Якщо у вас є діти, зосередьтеся на їхніх інтересах. Визначте, як буде організовано спілкування з дитиною, чи буде призначено аліменти, і які умови виховання дітей будуть найкращими для них. Переговори: Спробуйте вирішити спір мирним шляхом через переговори або медіацію. Це допоможе уникнути судових процесів і зберегти хороші відносини.",
};
